#include "Gameplay.h"
#include "../Core/Logger.h"

namespace Gameplay
{
//-----------------------------------------------------------------
void Gameplay::Init()
{
	INFO("Инициализация игровой логики");
	
	m_isRun = true;
}
//-----------------------------------------------------------------
void Gameplay::OnFrame()
{

}
//-----------------------------------------------------------------
bool Gameplay::IsRun()
{
	return m_isRun;
}
//-----------------------------------------------------------------
}